ci_4/app/Controllers/Admin/Kategori.php

SELECT *
FROM `tbl_kategori`
---
    public function read()
    {
        $pager = \Config\Services::pager();
        $model = new Kategori_M();
        //$kategori = $model ->findAll();

        $data = [
            'judul'     => 'DATA KATEGORI',
            //'kategori'  => $kategori,
            'kategori'  => $model->paginate(3, 'page'),
            'pager'     => $model->pager

        ];

INSERT INTO `tbl_kategori` (`kategori`, `keterangan`) VALUES ('gerfhre', 'rgsdgers')
---
    public function insert()
    {
        $model = new Kategori_M();

        if ($model->insert($_POST) === false) {